tests/cassettes/test_discount/TestDiscount.test_update_discount.yaml

interactions:
- request:
    body: '{"amount": "800", "description": "Test Discount Updated", "type": "flat",
      "enabled_for_checkout": true, "code": "TESTDISCOUNT", "currency_code": "USD",
      "recur": true, "maximum_recurring_intervals": 12, "usage_limit": 100, "restrict_to":
      ["pro_01h89b2j66qq82x6vn5d39c4av"], "status": "active"}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer 559a1eb08e249528c6d897ef407aedbb13fd8d73e0234bafc1
      Connection:
      - keep-alive
      Content-Length:
      - '292'
      Content-type:
      - application/json
      User-Agent:
      - python-requests/2.31.0
    method: PATCH
    uri: https://sandbox-api.paddle.com/discounts/dsc_01h8xfbnfy4gtfd15fjgxfbrfs
  response:
    body:
      string: '{"data":{"id":"dsc_01h8xfbnfy4gtfd15fjgxfbrfs","status":"active","description":"Test
        Discount Updated","enabled_for_checkout":true,"code":"TESTDISCOUNT","type":"flat","amount":"800","currency_code":"USD","recur":true,"maximum_recurring_intervals":12,"usage_limit":100,"restrict_to":["pro_01h89b2j66qq82x6vn5d39c4av"],"expires_at":"2023-09-27T07:05:03.808311Z","times_used":0,"created_at":"2023-08-28T07:05:04.254Z","updated_at":"2023-08-28T07:09:23.763Z"},"meta":{"request_id":"82d39996-2c37-4de0-9f45-221eb53689fd"}}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 7fdaba7e6e3b2bee-FRA
      Cache-Control:
      - no-store, max-age=0
      Connection:
      - keep-alive
      Content-Security-Policy:
      - default-src 'none'; frame-ancestors 'none'; base-uri 'none'
      Content-Type:
      - application/json
      Cross-Origin-Embedder-Policy:
      - require-corp
      Cross-Origin-Opener-Policy:
      - same-origin
      Cross-Origin-Resource-Policy:
      - same-site
      Date:
      - Mon, 28 Aug 2023 07:09:23 GMT
      Permissions-Policy:
      - accelerometer=(),ambient-light-sensor=(),autoplay=(),battery=(),camera=(),display-capture=(),document-domain=(),encrypted-media=(),fullscreen=(),gamepad=(),geolocation=(),gyroscope=(),layout-animations=(self),legacy-image-formats=(self),magnetometer=(),microphone=(),midi=(),oversized-images=(self),payment=(),picture-in-picture=(),publickey-credentials-get=(),speaker-selection=(),sync-xhr=(self),unoptimized-images=(self),unsized-media=(self),usb=(),screen-wake-lock=(),web-share=(),xr-spatial-tracking=()
      Pragma:
      - no-cache
      Referrer-Policy:
      - no-referrer
      Request-Id:
      - 82d39996-2c37-4de0-9f45-221eb53689fd
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=WD6nDytgwWxDmZ6GT3Jrc8l3cAB1XvpSckgH3GkemdY-1693206563-0-AbHUYUGT+BYlF3U6ljRO9Gd7HKddlZ6XDJe96lWQBQxXoBJQ+jXITFlfyHEBTv9pMP+RonRDQcSVd4CwwemM6q8=;
        path=/; expires=Mon, 28-Aug-23 07:39:23 GMT; domain=.paddle.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Transfer-Encoding:
      - chunked
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - deny
      X-Permitted-Cross-Domain-Policies:
      - none
      content-length:
      - '517'
    status:
      code: 200
      message: OK
version: 1
