tests/cassettes/test_discount/TestDiscount.test_create_discount.yaml

interactions:
- request:
    body: '{"amount": "1000", "description": "Test Discount", "type": "flat", "enabled_for_checkout":
      true, "code": "TESTDISCOUNT", "currency_code": "USD", "recur": true, "maximum_recurring_intervals":
      12, "usage_limit": 100, "restrict_to": ["pro_01h89b2j66qq82x6vn5d39c4av"], "expires_at":
      "2023-09-27T07:05:03.808311Z"}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer 559a1eb08e249528c6d897ef407aedbb13fd8d73e0234bafc1
      Connection:
      - keep-alive
      Content-Length:
      - '310'
      Content-type:
      - application/json
      User-Agent:
      - python-requests/2.31.0
    method: POST
    uri: https://sandbox-api.paddle.com/discounts
  response:
    body:
      string: '{"data":{"id":"dsc_01h8xfbnfy4gtfd15fjgxfbrfs","status":"active","description":"Test
        Discount","enabled_for_checkout":true,"code":"TESTDISCOUNT","type":"flat","amount":"1000","currency_code":"USD","recur":true,"maximum_recurring_intervals":12,"usage_limit":100,"restrict_to":["pro_01h89b2j66qq82x6vn5d39c4av"],"expires_at":"2023-09-27T07:05:03.808311Z","times_used":0,"created_at":"2023-08-28T07:05:04.254Z","updated_at":"2023-08-28T07:05:04.254Z"},"meta":{"request_id":"cacccc0e-f2bc-4f9a-8c27-45a067e7e13c"}}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 7fdab428cdc237dd-FRA
      Cache-Control:
      - no-store, max-age=0
      Connection:
      - keep-alive
      Content-Length:
      - '510'
      Content-Security-Policy:
      - default-src 'none'; frame-ancestors 'none'; base-uri 'none'
      Content-Type:
      - application/json
      Cross-Origin-Embedder-Policy:
      - require-corp
      Cross-Origin-Opener-Policy:
      - same-origin
      Cross-Origin-Resource-Policy:
      - same-site
      Date:
      - Mon, 28 Aug 2023 07:05:04 GMT
      Permissions-Policy:
      - accelerometer=(),ambient-light-sensor=(),autoplay=(),battery=(),camera=(),display-capture=(),document-domain=(),encrypted-media=(),fullscreen=(),gamepad=(),geolocation=(),gyroscope=(),layout-animations=(self),legacy-image-formats=(self),magnetometer=(),microphone=(),midi=(),oversized-images=(self),payment=(),picture-in-picture=(),publickey-credentials-get=(),speaker-selection=(),sync-xhr=(self),unoptimized-images=(self),unsized-media=(self),usb=(),screen-wake-lock=(),web-share=(),xr-spatial-tracking=()
      Pragma:
      - no-cache
      Referrer-Policy:
      - no-referrer
      Request-Id:
      - cacccc0e-f2bc-4f9a-8c27-45a067e7e13c
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=oBynsM87XAMG_TYRL2dSGxtPVhSw3mQxvuvTPWcnPas-1693206304-0-AVslh67+GbDCB06EdUnmg8LL7lU9qiPFcP2n1ROkKu8vPpqxS4EXwF+CeT577v73+DtwLtIQjs74FXx2GXf0uqw=;
        path=/; expires=Mon, 28-Aug-23 07:35:04 GMT; domain=.paddle.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - deny
      X-Permitted-Cross-Domain-Policies:
      - none
    status:
      code: 201
      message: Created
version: 1
